"""Постоянные константы для расчётов"""
Max = {"MaxHP": 500, "MaxMP": 640, "MaxSM": 540, "MaxDF": 24, "MaxDMG": 64}
Min = {"MinHP": 100, "MinMP": 40, "MinSM": 60, "MinDF": 4, "MinDMG": 20}

Races = {"Человек": 2, "Зверолюд": 2.5, "Демон": 3, "Эльф": 2.2, "Клойд": 2.7, "Дварф": 2.3, "Фауст": 2.1, "Грофт": 2.4, "Триан": 1.5, "Сельт": 2.8, "Айсмир": 1.8, "Котлиты": 1.9}

Class = {"Маг": 2.5, "Воин": 3, "Стрелок": 2, "Никто": 4}
ClassBonus = {"Никто": {"Мудрость": 25}, "Маг": {"Мудрость": 5}}

Profs = {"Чародей": 4, "Жрец": 5, "Иллюзионист": 3, "Паладин": 4, "Варвар": 3, "Наёмник": 4, "Снайпер": 2, "Бомбардир": 3, "Лукфит": 1, "Падший": 5}

Specs = {"Авангард": 8, "Поддержка": 4, "Смешенный": 6}

Skills = {"Воровство": 2, "Взлом": 25, "Обман": 35, "Запугивание": 47, "Социальность": 45, "Мастерство": 0,
		"Мудрость": 15, "Телосложение": 5, "Внимательность": 3, "Изобретательность": 28, "Сила": 25, "Ловкость": 5,
		"Меткость": 65, "Манипулирование": 8, "Воля": 35, "Скрытность": 4, "Травничество": 2, "Ресурсы": 55,
		"Езда верхом": 0, "Разведка": 28, "Амфибицизм": 0, "Кошачий глаз": 3, "Адаптивность": 0, "Психика": 23,
		"Торговля": 0, "Оккультизм": 0, "Благословение": 2, "Правосудие": 0, "Первая помощь": 0, "Очарование": 25,
		"Крепкий желудок": 15, "Поглощение": 0}
SkillsBonus = {"Воровство": 8, "Взлом": 5, "Обман": 6, "Запугивание": 4, "Социальность": 4, "Мастерство": 0,
				"Мудрость": 5, "Телосложение": 8, "Внимательность": 3, "Изобретательность": 6, "Сила": {"Вес": 4, "Блок": 5}, "Ловкость": 5,
				"Меткость": 4, "Манипулирование": 5, "Воля": 9, "Скрытность": 6, "Травничество": 15, "Ресурсы": 3,
				"Езда верхом": 0, "Разведка": 4, "Амфибицизм": 0, "Кошачий глаз": 1, "Адаптивность": 0, "Психика": 8,
				"Торговля": {"Продажа": 10, "Покупка": 7}, "Оккультизм": {"Урон": 5, "Потребление": 1},
				"Благословение": 5, "Правосудие": {"Урон": 15, "Поглощение": 8}, "Первая помощь": {"Снижение": 12, "Лечение": 4},
				"Очарование": 8, "Крепкий желудок": 2, "Поглощение": 0.002}

Abilities = {"Раскат Молнии": {"Требования": 45, "Урон": 64, "Время": 2, "Откат": 8}}

Religions = ["Сихритизм", "Лейксийцизм", "Марифизм", "Силитий", "Вольфизм", "Гротизм"]
Ranks = ["A", "B", "C", "D", "E", "X"]

Weights = {"Инвентарь": 12, "Экипировка": 14}


